In [1]:
import pandas as pd

# Sample data
data = {
    'Name': ['Arun', 'Rohit', 'Neha', 'Pooja'],
    'Age': [25, 30, 22, 28],
    'City': ['Noida', 'Delhi', 'Mumbai', 'Pune']
}

# Creating a DataFrame
df = pd.DataFrame(data)

# Display DataFrame
print(df)

    Name  Age    City
0   Arun   25   Noida
1  Rohit   30   Delhi
2   Neha   22  Mumbai
3  Pooja   28    Pune

1. Basic Operations

In [2]:
print(df.shape)   # Rows & Columns ka size batata hai
print(df.columns) # Column ke names batata hai
print(df.dtypes)  # Column ka data type batata hai
print(df.info())  # Complete summary deta hai
print(df.describe()) # Numerical columns ka statistics deta hai

(4, 3)
Index(['Name', 'Age', 'City'], dtype='object')
Name    object
Age      int64
City    object
dtype: object
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes
None
         Age
count   4.00
mean   26.25
std     3.50
min    22.00
25%    24.25
50%    26.50
75%    28.50
max    30.00

2. Data Access (Indexing & Slicing)

In [3]:
print(df['Name'])       # Single column access
print(df[['Name', 'Age']])  # Multiple columns access

0     Arun
1    Rohit
2     Neha
3    Pooja
Name: Name, dtype: object
    Name  Age
0   Arun   25
1  Rohit   30
2   Neha   22
3  Pooja   28

(b) Specific rows access karna

In [4]:
print(df.iloc[1])   # 2nd row ko access karna (index 1)
print(df.iloc[1:3]) # 2nd aur 3rd row ko access karna
#print(df.loc[0])    # Index-based row access

Name    Rohit
Age        30
City    Delhi
Name: 1, dtype: object
    Name  Age    City
1  Rohit   30   Delhi
2   Neha   22  Mumbai

3. Data Manipulation

(a) Naye column add karna

In [5]:
df['Salary'] = [50000, 60000, 45000, 55000]
print(df)

    Name  Age    City  Salary
0   Arun   25   Noida   50000
1  Rohit   30   Delhi   60000
2   Neha   22  Mumbai   45000
3  Pooja   28    Pune   55000

(b) Existing column modify karna

In [8]:
df['Age'] = df['Age'] + 2  # Sabki age +1 ho jayegi
df

    Name  Age    City  Salary
0   Arun   29   Noida   50000
1  Rohit   34   Delhi   60000
2   Neha   26  Mumbai   45000
3  Pooja   32    Pune   55000

(c) Column delete karna

In [9]:
df.drop(columns=['Salary'], inplace=True)

In [10]:
df

    Name  Age    City
0   Arun   29   Noida
1  Rohit   34   Delhi
2   Neha   26  Mumbai
3  Pooja   32    Pune

df.drop(columns=['Salary'], inplace=True)

4. Filtering (Condition Based Selection)
(a) Specific condition apply karna

In [11]:
adults = df[df['Age'] > 25]  # Sirf un logon ko show karega jinki age 25 se zyada hai
print(adults)

    Name  Age    City
0   Arun   29   Noida
1  Rohit   34   Delhi
2   Neha   26  Mumbai
3  Pooja   32    Pune

(b) Multiple conditions

In [12]:
filtered_df = df[(df['Age'] > 25) & (df['City'] == 'Noida')]
print(filtered_df)

   Name  Age   City
0  Arun   29  Noida

5. Sorting & Grouping
(a) Sorting

In [13]:
df.sort_values(by='Age', ascending=True, inplace=True)

In [14]:
df

    Name  Age    City
2   Neha   26  Mumbai
0   Arun   29   Noida
3  Pooja   32    Pune
1  Rohit   34   Delhi

(b) Grouping

In [17]:
grouped

6. Handling Missing Values

In [24]:
df.fillna(0, inplace=True)  # Missing values ko 0 se replace karna
df.dropna(inplace=True)     # Missing values wali rows hata dena

7. Exporting & Importing Data

(b) CSV file read karna
python
Copy
Edit

In [ ]:
df = pd.read_csv('output.csv')

(a) CSV file save karna

In [25]:
df.to_csv('output.csv', index=False)